const selectsValues = {
	Крыша: {
		Кровля: {
			conditions: {
				"Оцинк.сталь": ["Ослабление крепления отдельных листов к обрешетке.", "Неплотности, деформации фальцев.", "Повреждение цинкового покрытия.", "Пробоины стальных листов.", "Поверхностная коррозия листов.", "Выборочный ремонт.", "Просветы при осмотре со стороны чердака."],
				"Черн. сталь": ["Ослабление крепления отдельных листов к обрешетке.", "Неплотности, деформации фальцев.", "Пробоины стальных листов.", "Поверхностная коррозия листов.", "Повреждение окрасочного слоя.", "Выборочный ремонт.", "Просветы при осмотре со стороны чердака."],
				Шифер: ["Ослабление креплений отдельных асбоцементных листов к обрешетке.", "Отсутствие отдельных листов, отколы и трещины.", "Протечки и просветы в отдельных местах.", "Повреждение окрытия конька."],
				Рулонная: ["Вздутие рубероидного ковра.", "Застойные зоны.", "Отрыв рубероидного ковра от вертикальных поверхностей.", "Растрескивание мастики.", "Разрывы рубероидного ковра.", "Прорастание мха.", "Протечки кровли.", "Истертость покрытия."],
				Мастичная: ["Растрескивание мастичного покрытия.", "Утрата мастичного покрытия.", "Отслоение покрытия от основания."],
				"Ж/б плиты": ["Наличие микротрещин в плитах", "Следы протечек на нижней плоскости плит.", "Повреждение гидроизоляции стыков плит", "Повреждение гидроизоляции в лотковой части"],
				Металлочерепица: ["Ослабление крепления отдельных листов к обрешетке.", "Неплотности, деформации фальцев.", "Пробоины стальных листов.", "Поверхностная коррозия листов.", "Повреждение окрасочного слоя.", "Выборочный ремонт.", "Просветы при осмотре со стороны чердака."],
			},
			conditionNode: appVariables["options"]["Крыша"]["Материал кровли"],
		},
		Свесы: {
			conditions: {
				"Hаружный": ["Деформация желобов.", "Коррозия желобов.", "Коррозия ограждений.", "Замачивание консолей.", "Пробоины, протечки.", "Ослабление крепления ограждений."],
				"Внутренний": ["Деформация окрытий парапетов.", "Коррозия окрытий парапетов.", "Утрата окрытий.", "Коррозия ограждений.", "Деформация фартуков, отливов.", "Коррозия фартуков, отливов."],
			},
			conditionNode: appVariables["options"]["Водоотвод"]["Тип водоотвода"],
		},
		"Стропильная система": {
			conditions: {
				Безусловно: ["Ослабление креплений: болтов, хомутов, скоб.", "Поражение гнилью, жучком древесины мауэрлата, стропил, обрешетки.", "Ослабление врубок и соединений.", "Наличие дополнительных временных креплений стропильных ног.", "Увлажнение древесины.", "Наличие трещин в стропилах, в том числе продольных.", "Отсутствие (утрата) огнезащитной обработки.", "Замачивание конструкций.", "Следы огневого воздействия."],
			},
			conditionNode: false,
		},
		Чердак: {
			conditions: {
				"Холодн.чердак": [
					"Отсутствие на продухах решеток от птиц.",
					"Захламленность помещений.",
					"Неисправность заполнений слуховых окон.",
					"Повреждение лестниц к слуховым окнам.",
					"Неисправность заполнений выходов на кровлю.",
					"Отсутствие продухов и прикарнизных щелей.",
					"Отсутствие ходовых досок.",
					"Уплотнение утеплителя чердачного перекрытия.",
					"Нарушение температурно-влажностного режима помещения.",
					"Коррозия поддонов испарителей.",
				],
				"Теплый чердак": [
					"Отсутствие на оголовках вентканалов решеток от птиц.",
					"Захламленность помещений.",
					"Неисправность заполнений слуховых окон.",
					"Повреждение лестниц к слуховым окнам.",
					"Неисправность заполнений выходов на кровлю.",
					"Отсутствие продухов и прикарнизных щелей.",
					"Отсутствие ходовых досок.",
					"Уплотнение утеплителя чердачного перекрытия.",
					"Нарушение температурно-влажностного режима помещения.",
					"Коррозия поддонов испарителей.",
				],
			},
			conditionNode: appVariables["options"]["Крыша"]["Конструкция крыши"],
		},
		"Покрытие ж/б": {
			conditions: {
				Безусловно: ["Трещины по нижней плоскости плит.", "Сколы ребер плит.", "Обнажение арматурных стержней.", "Следы протечек.", "Замачивание.", "Волосяные трещины усадочного характера."],
			},
			conditionNode: false,
		},
	},
	Водоотвод: {
		"Тип водоотвода": {
			conditions: {
				"Внутренний": ["Следы протечек в узлах устройства водоприемных воронок.", "Коррозия трубопровода.", "Деформация участков трубопровода.", "Растрескивание отмостки.", "Просадка отмостки.", "Отсутствие водоотводящих лотков."],
				"Hаружный": ["Деформация водостоков.", "Коррозия звеньев.", "Утрата отметов", "Растрескивание отмостки.", "Просадка отмостки.", "Отсутствие водоотводящих лотков."],
				"Неорганизованный.": ["Растрескивание отмостки.", "Просадка отмостки."],
			},
			conditionNode: appVariables["options"]["Водоотвод"]["Тип водоотвода"],
		},
	},
	"Межпанельные стыки": {
		"Межпанельные стыки": {
			conditions: {
				Безусловно: ["Потемнение, растрескивание герметика.", "Утрата адгезии, отрыв герметика от основания.", "Промерзание стыков.", "Выборочная герметизация."],
			},
			conditionNode: false,
		},
	},
	Фасад: {
		Фасад: {
			conditions: {
				"под расшивку": ["Выветривание раствора из швов.", "Трещины по кладке раскрытием до 2 мм.", "Замачивание кладки, биоповреждение.", "Повреждение отделки цоколя.", "Локальные загрязнения.", "Сколы отдельных кирпичей.", "Высолы на поверхности кладки", "Участки эрозии кладки."],
				"облицовка керамическими блоками": ["Выветривание раствора из швов.", "Трещины по кладке раскрытием до 2 мм.", "Замачивание кладки, биоповреждение.", "Повреждение отделки цоколя.", "Локальные загрязнения.", "Сколы отдельных блоков."],
				"облицовка плиткой": ["Сколы отдельных плиток", "Утрата облицовочных плиток на локальных участках.", "Повреждение отделки цоколя.", "Локальные загрязнения."],
				"облицовка кирпичом": ["Замачивание кладки  на отдельных участках", "Ослабление крепления облицовочной версты.", "Эрозия кладки.", "Выветривание раствора из швов.", "Обрушение штукатурки торцов плит.", "Высолы на поверхности кладки.", "Повреждение отделки цоколя.", "Локальные загрязнения."],
				"фактурная": ["Повреждение отделки на отдельных участках.", "Локальные замачивания.", "Локальные загрязнения.", "Повреждение отделки цоколя."],
				"вентилируемый с воздушной прослойкой": ["Повреждение отдельных облицовочных плиток.", "Локальные загрязнения.", "Повреждение отделки цоколя."],
				"окраска по штукатурке (в т.ч. панели, блоки)": ["Растрескивание штукатурного слоя.", "Повреждение окрасочного слоя.", "Обрушение штукатурного слоя на локальных участках.", "Ослабление адгезии штукатурного слоя.", "Опасность обрушения штукатурного слоя на пешеходную зону.", "Замачивание штукатурного слоя.", "Локальные загрязнения.", "Повреждение отделки цоколя."],
				"окраска по штукатурке и утеплителю": ["Растрескивание штукатурного слоя.", "Повреждение окрасочного слоя.", "Утрата штукатурного слоя на отдельных участках.", "Замачивание.", "Локальные загрязнения.", "Повреждение отделки цоколя."],
				"окраска по кирпичу": ["Повреждение окрасочного слоя.", "Выветривание раствора из швов.", "Трещины по кладке раскрытием до 2 мм.", "Замачивание кладки, биоповреждения.", "Повреждение отделки цоколя.", "Локальные загрязнения.", "Сколы отдельных кирпичей.", "Высолы на поверхности кладки.", "Участки эрозии кладки."],
				"окраска по дереву": ["Повреждение окрасочного слоя.", "Гнилостное повреждение облицовки."],
			},
			conditionNode: appVariables["options"]["Фасад"]["Отделка стен"],
		},
	},
	Балконы: {
		Балконы: {
			conditions: {
				Безусловно: ["Сколы бетона", "Обрушение защитного слоя бетона.", "Обнажение, коррозия рабочей арматуры.", "Прогиб плит.", "Коррозия стальных несущих элементов.", "Замачивание нижней плоскости плит", "Ослабление крепления ограждений.", "Замачивание стен в узле защемления плит.", "Деформация отливов."],
			},
			conditionNode: false,
		},
		Лоджии: {
			conditions: {
				Безусловно: ["Сколы бетона плит.", "Обрушение защитного слоя бетона.", "Обнажение, коррозия рабочей арматуры", "Прогиб плит.", "Замачивание нижней плоскости плит.", "Ослабление крепления ограждений.", "Замачивание стен в узле защемления плит.", "Деформация отливов."],
			},
			conditionNode: false,
		},
		Козырьки: {
			conditions: {
				Безусловно: ["Сколы бетона", "Обрушение защитного слоя бетона.", "Обнажение, коррозия рабочей арматуры", "Прогиб плит.", "Коррозия стальных несущих элементов.", "Замачивание нижней плоскости плит", "Ослабление крепления ограждений.", "Замачивание стен в узле защемления плит.", "Деформация отливов."],
			},
			conditionNode: false,
		},
		Эркеры: {
			conditions: {
				Безусловно: ["Сколы бетона", "Обрушение защитного слоя бетона.", "Обнажение, коррозия рабочей арматуры", "Коррозия стальных несущих элементов.", "Замачивание нижней плоскости плит"],
			},
			conditionNode: false,
		},
	},
	Стены: {
		Стены: {
			conditions: {
				"Красн.кирпич": ["Вертикальные, наклонные трещины раскрытием до 2 мм.", "Повреждение отделки.", "Замачивание", "Эрозия кладки.", "Промерзание, образование плесени", "Ослабление кирпичной кладки", "Устройство временного усиления", "Выпадение кирпичей.", "Выветривание раствора из швов.", "Отслоение облицовки.", "Выпучивание кладки на отдельных участках."],
				"Силик.кирпич": ["Вертикальные, наклонные трещины раскрытием до 2 мм.", "Повреждение отделки.", "Замачивание", "Эрозия кладки.", "Промерзание, образование плесени", "Ослабление кирпичной кладки", "Устройство временного усиления", "Выпадение кирпичей. ", "Выветривание раствора из швов.", "Отслоение облицовки.", "Выпучивание кладки на отдельных участках."],
				"Ж/б панели": ["Повреждения отделки панелей.", "Трещины, выбоины, отслоение защитного слоя бетона.", "Протечки и промерзание в стыках.", "Ржавые потеки, оголение арматуры."],
				"Крупн.блоки": ["Выбоины, трещины в стеновых блоках.", "Отслоение и выветривание раствора в стыках.", "Следы протечек через стыки внутри здания.", "Следы промерзаний через стыки.", "Искривление горизонтальных и вертикальных стен.", "Разрушение блоков и панелей."],
				Деревянные: [
					"Повреждения наружной обшивки щитов.",
					"Поражение гнилью нижней части щитов и обвязки.",
					"Образование щелей в вертикальных стыках между щитами.",
					"Перекос стен, выпучивание, отклонение от вертикали.",
					"Деформация стен, наличие временных креплений и подпорок.",
					"Отпадение штукатурки или гниль в древесине и отставание обшивки.",
					"Деформация стен, повреждение венцов гнилью и трещинами.",
					"Повреждения наружной обшивки и конопатки.",
				],
				"Ж/б монолит": ["Трещины, сколы бетона.", "Оголение арматуры.", "Высолы на поверхности бетона."],
			},
			conditionNode: appVariables["options"]["Стены"]["Материал стен"],
		},
	},
	Подвал: {
		Подвал: {
			conditions: {
				Безусловно: ["Подтопление грунтовыми водами", "Подтопление в результате аварий инженерных коммуникаций.", "Поражение конструкций грибком и плесенью.", "Повреждение отделки.", "Нарушение ТВР.", "Разрушение приямков, лестниц, ступеней входов в подвал, полов."],
			},
			conditionNode: false,
		},
	},
	"Тех. Подполье": {
		"Тех. Подполье": {
			conditions: {
				Безусловно: ["Подтопление грунтовыми водами", "Подтопление в результате аварий инженерных коммуникаций.", "Поражение конструкций грибком и плесенью.", "Повреждение отделки.", "Нарушение ТВР.", "Разрушение приямков, лестниц, ступеней входов в подвал, полов."],
			},
			conditionNode: false,
		},
	},
	"Тех. этаж": {
		"Тех. этаж": {
			conditions: {
				Безусловно: ["Подтопление грунтовыми водами", "Подтопление в результате аварий инженерных коммуникаций.", "Поражение конструкций грибком и плесенью.", "Повреждение отделки.", "Нарушение ТВР.", "Разрушение приямков, лестниц, ступеней входов в подвал, полов."],
			},
			conditionNode: false,
		},
	},
	"Гараж стоянка (подземный)": {
		"Гараж стоянка (подземный)": {
			conditions: {
				Безусловно: ["Подтопление грунтовыми водами", "Подтопление в результате аварий инженерных коммуникаций.", "Поражение конструкций грибком и плесенью.", "Повреждение отделки.", "Нарушение ТВР.", "Разрушение приямков, лестниц, ступеней входов в подвал, полов."],
			},
			conditionNode: false,
		},
	},
	"Места общего пользования": {
		Вестибюли: {
			conditions: {
				Безусловно: ["Протечки.", "Повреждение отделки.", "Трещины в узлах примыкания к зданию.", "Естественный износ напольного покрытия."],
			},
			conditionNode: false,
		},

		Крыльца: {
			conditions: {
				Безусловно: ["Растрескивание покрытия площадок.", "Просадка площадок.", "Обрушение штукатурки бортовых тумб.", "Контруклон площадок.", "Коррозия поручней."],
			},
			conditionNode: false,
		},
		"Пандусы наружные": {
			conditions: {
				Безусловно: ["Выбоины на поверхности.", "Коррозия пандуса.", "Коррозия поручней.", "Повреждение окраски."],
			},
			conditionNode: false,
		},
		"Пандусы внутриподъездные": {
			conditions: {
				Безусловно: ["Выбоины на поверхности.", "Коррозия пандуса.", "Коррозия поручней.", "Повреждение окраски."],
			},
			conditionNode: false,
		},

		"Сходы/съезды": {
			conditions: {
				Безусловно: ["Выбоины на поверхности.", "Коррозия пандуса.", "Коррозия поручней.", "Повреждение окраски."],
			},
			conditionNode: false,
		},
		"Окна, двери": {
			conditions: {
				Безусловно: [
					"Рассыхание деревянных оконных и дверных переплетов.",
					"Расшатанность оконных и дверных переплетов.",
					"Отсутствие и неисправность фурнитуры.",
					"Поражение гнилью и жучком деревянных оконных и дверных блоков.",
					"Неисправность или отсутствие доводчиков.",
					"Коррозия и деформация элементов коробок и переплетов, полотен.",
					"Износ или отсутствие уплотнительных прокладок.",
					"Необходимость регулировки отдельных окон.",
				],
			},
			conditionNode: false,
		},
		"Внутренняя отделка помещений": {
			conditions: {
				Безусловно: ["Локальные загрязнения.", "Следы замачивания.", "Шелушение окрасочного слоя.", "Растрескивание штукатурного слоя.", "Повреждение напольной плитки.", "Естественный износ напольного покрытия."],
			},
			conditionNode: false,
		},
	},
	Лестницы: {
		Лестницы: {
			conditions: {
				"Ж/бет.марши": ["Выбоины и сколы в ступенях.", "Трещины на лестничных площадках.", "Повреждения перил, шаткость ограждающих решеток.", "Трещины в сопряжениях маршевых плит с несущими конструкциями.", "Обнажение, коррозия арматуры.", "Прогиб маршей.", "Естественный износ ступеней."],
				"По косоурам": ["Выбоины и трещины в ступенях и площадках.", "Повреждения перил, шаткость ограждающих решеток.", "Истертость ступеней и площадок.", "Прогиб косоуров.", "Ослабление связи косоуров с площадками.", "Отсутствие штукатурки косоуров.", "Коррозия металлических косоуров."],
				Деревянные: ["Трещины, коробление ступеней.", "Истертость ступеней.", "Трещины вдоль волокон на досках на лестничной площадке.", "Повреждения перил, шаткость ограждающих решеток.", "Разрушение врубок в конструкции лестницы.", "Гниль и прогибы в тетивах.", "Зыбкость при ходьбе."],
			},
			conditionNode: appVariables["options"]["Лестницы"]["Конструкция"],
		},
	},
	Перекрытия: {
		Перекрытия: {
			conditions: {
				"Жел.бетонные": ["Трещины в швах между плитами.", "Трещины в плитах, следы протечек или промерзаний.", "Трещины с оголением арматуры, прогиб.", "Смещение плит относительно одна другой по высоте вследствие деформаций.", "Вывал раствора из межплитных швов.", "Обнажение, коррозия рабочей арматуры", "Трещины усадочного характера."],
				"Деревянные": ["Трещины в местах сопряжений балок с несущими стенами.", "Следы увлажнений.", "Наличие временных креплений, подпорок в отдельных местах.", "Отслоение штукатурки.", "Продольные и поперечные трещины в перекрытии.", "Ощутимая зыбкость, прогиб.", "Обнажение древесины балок, поражение гнилью и жучком.", "Прогиб балок в зоне 1-ого этажа, при отсутствии подвала."],
				"Сводчатые": ["Трещины в средней части сводов вдоль балок.", "Расшатывание отдельных кирпичей.", "Выщелачивание раствора в швах.", "Выпадение отдельных кирпичей.", "Коррозия, прогиб балок."],
				"Смешанные": [
					"Трещины в местах сопряжений балок с несущими стенами.",
					"Следы увлажнений.",
					"Наличие временных креплений, подпорок в отдельных местах.",
					"Отслоение штукатурки.",
					"Продольные и поперечные трещины в перекрытии.",
					"Ощутимая зыбкость, прогиб.",
					"Обнажение древесины балок, поражение гнилью и жучком.",
					"Трещины с оголением арматуры, прогиб.",
					"Обнажение, коррозия рабочей арматуры",
					"Трещины усадочного характера.",
				],
			},
			conditionNode: appVariables["options"]["Перекрытия"]["Материал перекрытия"],
		},
	},
	"Система отопления": {
		"Тех.подполье/тех.этаж": {
			conditions: {
				"Черн.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Засоры отдельных участков и в целом системы.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
			},
			conditionNode: appVariables["options"]["Система отопления"]["Материал трубопроводов"],
		},
		"Транзит питающий": {
			conditions: {
				"Черн.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Засоры отдельных участков и в целом системы.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
			},
			conditionNode: appVariables["options"]["Система отопления"]["Материал трубопроводов"],
		},
		Чердак: {
			conditions: {
				"Черн.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Засоры отдельных участков и в целом системы.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
			},
			conditionNode: appVariables["options"]["Система отопления"]["Материал трубопроводов"],
		},
		Этажи: {
			conditions: {
				"Черн.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Засоры отдельных участков и в целом системы.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
			},
			conditionNode: appVariables["options"]["Система отопления"]["Материал трубопроводов"],
		},
	},
	ГВС: {
		"Тех.подполье/тех.этаж": {
			conditions: {
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
				"Оцинк.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ГВС"]["Материал трубопроводов"],
		},
		"Транзит питающий": {
			conditions: {
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
				"Оцинк.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ГВС"]["Материал трубопроводов"],
		},
		Чердак: {
			conditions: {
				"Полимеры.": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
				"Оцинк.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ГВС"]["Материал трубопроводов"],
		},
		Этажи: {
			conditions: {
				"Полимеры.": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений"],
				"Оцинк. сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Недостаточный прогрев отдельных участков системы.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ГВС"]["Материал трубопроводов"],
		},
	},
	ХВС: {
		"Тех.подполье/тех.этаж": {
			conditions: {
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений", "Отсутствие теплоизоляции на стояках."],
				"Оцинк.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Отсутствие теплоизоляции на стояках.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ХВС"]["Материал трубопроводов"],
		},
		"Транзит питающий": {
			conditions: {
				"Полимеры": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений", "Отсутствие теплоизоляции на стояках."],
				"Оцинк.сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Отсутствие теплоизоляции на стояках.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ХВС"]["Материал трубопроводов"],
		},
		Этажи: {
			conditions: {
				"Полимеры.": ["Деформация трубопроводов.", "Неисправность отдельной запорной арматуры.", "Коррозия на стальных участках трубопроводов.", "Коррозия стальных муфтовых соединений", "Отсутствие теплоизоляции на стояках."],
				"Оцинк. сталь": [
					"Ослабление сальниковых набивок, прокладок смесителей и запорной арматуры.",
					"Капельные течи в местах врезки запорной арматуры.",
					"Следы ремонта отдельными участками, выборочная замена.",
					"Повреждение теплоизоляции магистралей.",
					"Отсутствие теплоизоляции на стояках.",
					"Недействующая запорно-регулировочная арматура.",
					"Коррозия, наличие свищей и хомутов в трубопроводах.",
					"Коррозия трубопроводов, соединений, арматуры.",
				],
			},
			conditionNode: appVariables["options"]["ХВС"]["Материал трубопроводов"],
		},
	},
	Канализация: {
		"Тех.подполье/тех.этаж": {
			conditions: {
				Чугун: ["Просадка участков трубопроводов в подвале, засоры, затопление, нарушение уклонов.", "Разрушение опорных столбиков, отсутствие крышек прочисток и ревизий.", "Нарушение герметичности соединений, трещины чугунных труб.", "Свищи, пробоины в трубопроводах в подвале и на этажах.", "Растрескивание зачеканки.", "Следы протечек по раструбам и отводам.", "Выборочный ремонт вставками из ПВХ."],
				ПВХ: ["Просадка участков трубопроводов в подвале, засоры, затопление, нарушение уклонов.", "Разрушение опорных столбиков, отсутствие крышек прочисток и ревизий.", "Нарушение герметичности соединений, деформация ПВХ труб.", "Следы протечек по раструбам и отводам."],
			},
			conditionNode: appVariables["options"]["Канализация"]["Материал трубопроводов"],
		},
		Этажи: {
			conditions: {
				Чугун: ["Просадка участков трубопроводов в подвале, засоры, затопление, нарушение уклонов.", "Разрушение опорных столбиков, отсутствие крышек прочисток и ревизий.", "Нарушение герметичности соединений, трещины чугунных труб.", "Свищи, пробоины в трубопроводах в подвале и на этажах.", "Растрескивание зачеканки.", "Следы протечек по раструбам и отводам.", "Выборочный ремонт вставками из ПВХ."],
				ПВХ: ["Просадка участков трубопроводов в подвале, засоры, затопление, нарушение уклонов.", "Разрушение опорных столбиков, отсутствие крышек прочисток и ревизий.", "Нарушение герметичности соединений, деформация ПВХ труб.", "Следы протечек по раструбам и отводам."],
			},
			conditionNode: appVariables["options"]["Канализация"]["Материал трубопроводов"],
		},
	},
	Мусоропроводы: {
		Мусоропроводы: {
			conditions: {
				Безусловно: ["Поломки, негерметичность приемных клапанов.", "Пробоины стволов, разрушение отдельных участков, деформация.", "Коррозия мусороприемного оборудования.", "Отсутствие облицовки, систем горячего и холодного водоснабжения, канализации в мусорокамерах.", "Повреждение внутренней отделки мусорокамер.", "Постоянные засоры стволов.", "Недействующее оборудование для прочистки."],
			},
			conditionNode: false,
		},
	},
	"Связь с ОДС": {
		"Связь с ОДС": {
			conditions: {
				Безусловно: ["Неисправность вызывных панелей.", "Неисправность датчиков открытия."],
			},
			conditionNode: false,
		},
	},
	Вентиляция: {
		Вентиляция: {
			conditions: {
				Безусловно: ["Разрушение вентканалов на чердаке.", "Засор вентиляционных каналов.", "Отсутствие защитных сеток на чердаке.", "Жалобы собственников на недостаточную тягу."],
			},
			conditionNode: false,
		},
	},
	"Система промывки и прочистки стволов мусоропроводов": {
		"Система промывки и прочистки стволов мусоропроводов": {
			conditions: {
				Безусловно: ["Не подключена к системе водоснабжения", "Не подключена к системе электроснабжения", "Разукомплектована.", "По внешним признакам не эксплуатируется."],
			},
			conditionNode: false,
		},
	},
	"ОЗДС (охранно-защитная дератизационная система)": {
		"ОЗДС (охранно-защитная дератизационная система)": {
			conditions: {
				Безусловно: ["На момент обследования отключена.", "При апробации не функционирует.", "Проверено апробацией."],
			},
			conditionNode: false,
		},
	},
	Газоходы: {
		Газоходы: {
			conditions: {
				Безусловно: ["Повреждение оголовков газоходов.", "Растрескивание штукатурного слоя."],
			},
			conditionNode: false,
		},
	},
	Лифты: {
		Лифты: {
			conditions: {
				Безусловно: ["Значительный износ.", "Неисправность освещения.", "Повреждение отделочных материалов", "Применение горючих материалов в конструкциях кабины"],
			},
			conditionNode: false,
		},
	},
	"Подъёмное устройство для маломобильной группы населения": {
		"Подъёмное устройство для маломобильной группы населения": {
			conditions: {
				Безусловно: ["По внешним признакам не эксплуатируется.", "Проверено апробацией."],
			},
			conditionNode: false,
		},
	},
	"Система ЭС": {
		"Система ЭС": {
			conditions: {
				Безусловно: ["Устаревание, утрата эластичности изоляции.", "Скрутки, повреждение изоляции", "Следы перегрева контактных соединений.", "Применение проводов с алюминиевыми жилами.", "Неисправность этажных распределительных шкафов", "Подтопление ВРУ.", "Неблагоприятный ТВР в ВРУ."],
			},
			conditionNode: false,
		},
	},
	ППАиДУ: {
		ППАиДУ: {
			conditions: {
				Безусловно: ["Неисправность системы.", "Разукомплектованность вытяжных вентиляторов.", "При апробации не включается.", "Проверено апробацией."],
			},
			conditionNode: false,
		},
	},
	"Система ГС": {
		"Система ГС": {
			conditions: {
				Безусловно: ["Необходим вынос газопроводов из лестничных клеток.", "Необходимо устройство цокольных вводов."],
			},
			conditionNode: false,
		},
	},
	"Система видеонаблюдения": {
		"Система видеонаблюдения": {
			conditions: {
				Безусловно: ["По внешним признакам без повреждений."],
			},
			conditionNode: false,
		},
	},
};